CSI API ETABS v1

# cTendonObjSetSelected Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetSelected(
    	string Name,
    	bool Selected,
    	eItemType ItemType = eItemType.Objects
    )

    Function SetSelected (
    	Name As String,
    	Selected As Boolean,
    	Optional ItemType As eItemType = eItemType.Objects
    ) As Integer

    Dim instance As cTendonObj
    Dim Name As String
    Dim Selected As Boolean
    Dim ItemType As eItemType
    Dim returnValue As Integer

    returnValue = instance.SetSelected(Name,
    	Selected, ItemType)

    int SetSelected(
    	String^ Name,
    	bool Selected,
    	eItemType ItemType = eItemType::Objects
    )

    abstract SetSelected :
            Name : string *
            Selected : bool *
            ?ItemType : eItemType
    (* Defaults:
            let _ItemType = defaultArg ItemType eItemType.Objects
    *)
    -> int

#### Parameters

Name

    Type: SystemString

Selected

    Type: SystemBoolean

ItemType (Optional)

    Type: ETABSv1eItemType

#### Return Value

Type: Int32

See Also

#### Reference

cTendonObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com